# coding=utf-8
import os

os.environ.setdefault('DJANGO_SETTINGS_MODULE', 'ticketfinder.settings')
import django
django.setup()
from search.models import Station
stationsList = [
{'SC': "2700000",'SF': "АЛМА АТА",'SS': "АЛМА-АТА"},
{'SC': "2700002",'SF': "АЛМА АТА 1",'SS': "АЛМА-АТА 1"},
{'SC': "2700001",'SF': "АЛМА АТА 2",'SS': "АЛМА-АТА 2"},
{'SC': "2708000",'SF': "АСТАНА",'SS': "АСТАНА"},
{'SC': "2708905",'SF': "АКТАУ",'SS': "АКТАУ"},
{'SC': "2704600",'SF': "АКТОБЕ",'SS': "АКТОБЕ"},
{'SC': "2704830",'SF': "АТЫРАУ",'SS': "АТЫРАУ"},
{'SC': "2700900",'SF': "СЕМИПАЛАТ",'SS': "СЕМИПАЛАТИНСК"},
{'SC': "2700890",'SF': "У КАМЕНОГ",'SS': "УСТЬ-КАМЕНОГОРСК"},
{'SC': "2700770",'SF': "ЧИМКЕНТ",'SS': "ЧИМКЕНТ"},
{'SC': "2700710",'SF': "ДЖАМБУЛ",'SS': "ДЖАМБУЛ"},
{'SC': "2704999",'SF': "КЗЫЛ ОРДА",'SS': "КЗЫЛ-ОРДА"},
{'SC': "2040500",'SF': "ПЕТРОПАВЛ",'SS': "ПЕТРОПАВЛОВСК"},
{'SC': "2708900",'SF': "ПАВЛОДАР",'SS': "ПАВЛОДАР"},
{'SC': "2708951",'SF': "ЖАНА КАРАГ",'SS': "ЖАНА КАРАГАНДЫ"},
{'SC': "2708930",'SF': "ЖЕЗКАЗГАН",'SS': "ЖЕЗКАЗГАН"},
{'SC': "2708700",'SF': "КУСТАНАЙ",'SS': "КУСТАНАЙ"},
{'SC': "2704705",'SF': "ХРОМТАУ",'SS': "ХРОМТАУ"},
{'SC': "2708989",'SF': "БАЛХАШ 1",'SS': "БАЛХАШ 1"},
{'SC': "2708790",'SF': "БАЛХАШ 2",'SS': "БАЛХАШ 2"},
{'SC': "2708877",'SF': "АРКАЛЫК",'SS': "АРКАЛЫК"},
{'SC': "2709928",'SF': "АКСУ 1",'SS': "АКСУ 1"},
{'SC': "2100247",'SF': "БОРОВОЕ",'SS': "БОРОВОЕ"},
{'SC': "2700860",'SF': "ТУРКЕСТАН",'SS': "ТУРКЕСТАН"},
{'SC': "2040355",'SF': "КАРГАЛА",'SS': "КАРГАЛА"},
{'SC': "2704840",'SF': "ШАЛКАР",'SS': "ШАЛКАР"},
{'SC': "2708990",'SF': "ЕКИБАСТ 1",'SS': "ЕКИБАСТУЗ 1"},
{'SC': "2709984",'SF': "ТЕМИРТАУ",'SS': "ТЕМИРТАУ"},
{'SC': "2700690",'SF': "АЯГОЗ",'SS': "АЯГОЗ"},
{'SC': "2704822",'SF': "КУЛЬСАРЫ",'SS': "КУЛЬСАРЫ"},
]

for station in stationsList:
	s = Station()
	s.code = station['SC']
	s.short_name = station['SF']
	s.long_name = station['SS']
	s.save()